#ifndef QEDFILE_H
#define QEDFILE_H

#include <map>
#include "BaseFile.h"

// "#QED"
#define QED_SIGNATURE  0x44455123

#define QED_MAX_NUM_FLAGS           64
#define QED_MAX_NUM_STRING_VARS  10

#ifdef _MSC_VER
#pragma pack(push,1)
#endif

struct PACKED QEDHeader
{
    uint32_t signature;
    uint16_t endianess_check; // 4
    uint16_t pad; // 6 - Always 0
    uint32_t unk_08; // Always 1  (could be number of scripts, but since it is always to 1...)
    uint32_t unk_0C; // Always 0x10  (could be start of scripts header)
    uint32_t unk_10; // Always 0
    uint32_t num_conditions; // 0x14
    uint32_t conditions_start; // 0x18
    uint32_t num_actions; // 0x1C
    uint32_t actions_start; // 0x20
    uint32_t unk_24; // Always 0
};
CHECK_STRUCT_SIZE(QEDHeader, 0x28);

struct PACKED QEDInstruction
{
    uint16_t opcode; // 0 They are different for conditions/actions
    int16_t event_index; // 2 Event index within the "State"  Notice this is signed
    uint16_t state_index; // 4
    uint16_t pad; // 6
    uint32_t params_offset; // 8
};
CHECK_STRUCT_SIZE(QEDInstruction, 0xC);

struct PACKED QEDNumberPrimitive
{
    union
    {
        int32_t i;
        float f;
    } num;
};
CHECK_STRUCT_SIZE(QEDNumberPrimitive, 4);

struct PACKED QEDStringPrimitive
{
    char str[20];
};
CHECK_STRUCT_SIZE(QEDStringPrimitive, 0x14);

struct PACKED QEDParameterGroupNumber1
{
    QEDNumberPrimitive param1;
    QEDNumberPrimitive param2;
    QEDNumberPrimitive param3;
    QEDNumberPrimitive param4;
    QEDNumberPrimitive param5;
};
CHECK_STRUCT_SIZE(QEDParameterGroupNumber1, 0x14);

struct PACKED QEDParameterGroup2
{
    QEDNumberPrimitive param2;
    QEDNumberPrimitive param3;
    QEDNumberPrimitive param4;
};
CHECK_STRUCT_SIZE(QEDParameterGroup2, 0xC);

struct PACKED QEDParameterGroup1
{
    union
    {
        QEDParameterGroupNumber1 nums;
        QEDStringPrimitive string;
    } group;
};
CHECK_STRUCT_SIZE(QEDParameterGroup1, 0x14);

struct PACKED QEDInstructionParams
{
    QEDParameterGroup1 group1;
    QEDParameterGroup2 group2;
};
CHECK_STRUCT_SIZE(QEDInstructionParams, 0x20);

#ifdef _MSC_VER
#pragma pack(pop)
#endif

// Range 0-18
enum QedStatsType
{
    QED_STAT_LEVEL = 0, // "LV"
    QED_STAT_HP,
    QED_STAT_KI, // "KIRYOKU"
    QED_STAT_STAMINA, // "GIRYOKU"
    QED_STAT_ATK,
    QED_STAT_KI_ATK, // 5  "SHOT"
    QED_STAT_SUPER_ATK, // "SP_ATK"
    QED_STAT_SUPER_KI, // "SP_SHOT_ATK"
    QED_STAT_ATK_DAMAGE,
    QED_STAT_KI_DAMAGE, // "SHOT_DAMAGE"
    QED_STAT_SUPER_ATK_DAMAGE, // 10 "SP_ATK_DAMAGE"
    QED_STAT_SUPER_KI_DAMAGE, // "SP_SHOT_DAMAGE"
    QED_STAT_MAX_HP,    
    QED_STAT_MAX_KI, // "MAX KIRYOKU"
    QED_STAT_MAX_STAMINA, // "MAX GIRYOKU"
    QED_STAT_GUARD_ATTACK, // 15
    QED_STAT_GUARD_DAMAGE,
    QED_STAT_MOVE_SPEED,
    QED_STAT_BOOST_SPEED,

    NUM_QED_STATS
};
static_assert(NUM_QED_STATS == 19, "Correct the enumeration!!!");

enum QedFadeMode
{
    QED_FADE_WHITE = 0,
    QED_FADE_BLACK = 1,
    QED_FADE_NONBG = 2,
};

